{
"Arsenal": [
    "First club from the south of England to join the Football League, in 1893",
    "Founded in 1886 as Dial Square by workers at the Royal Arsenal in Woolwich",
    "Holds the record for the longest unbeaten streak in Premier League history (49 games from 2003–2004)",
    "Iconic red and white kit inspired by a donation from Nottingham Forest in the early 1900s",
    "Managed by Arsène Wenger for 22 years (longest in Premier League history)",
    "Moved from Highbury to the Emirates Stadium in 2006",
    "Thierry Henry, the club's top scorer, has a statue outside the Emirates Stadium",
    "Won the FA Cup in 2017, breaking the record for the most FA Cup titles (14)"
],
"Brentford": [
    "Founded in 1889 (originally as a rugby club before switching to soccer)",
    "Nickname: \"The Bees\" (from a misheard chant during a university match)",
    "Play at the Gtech Community Stadium (moved from Griffin Park in 2020)",
    "Promoted to the Premier League in 2021 (ending a 74-year absence)",
    "Highest league finish: fifth in the First Division in the 1935–36 season",
    "Known for data-driven recruitment strategy under owner Matthew Benham",
    "Ivan Toney, a top goal-scorer, played a key role in their Premier League promotion",
    "Griffin Park was unique for having a pub on each corner of the stadium",
    "Rivalry with nearby Fulham and Queens Park Rangers",
    "Reached its first major cup final in 1942 (London War Cup) and won it"
],
"Aston Villa": [
    "Founded in 1874 (one of the oldest clubs in England)",
    "One of the original 12 founding members of the Football League in 1888",
    "Seven English league championships and seven FA Cup wins",
    "European Cup win in 1982 (beat Bayern Munich 1–0 in the final)",
    "Villa Park known for hosting multiple FA Cup semi-finals",
    "Biggest rivalry with Birmingham City (Second City Derby)",
    "Former player Gareth Barry holds the record for most Premier League appearances",
    "Unique motto: \"Prepared\" (symbolizing readiness for challenges)",
    "First manager George Ramsay served for over 40 years",
    "Relegated in 2016 but fought back to secure promotion in 2019"
],
"Burnley": [
    "They were formed in 1882 and was one of the founding members of the Football League", 
    "The club won its first league title in 1921 and a second in 1960",
    "The club nickname The Clarets comes from their iconic claret and blue colors",
    "Turf Moor, their stadium, has been their home since 1883",
    "The club was one of the first clubs to install floodlights in the 1950s.",
    "They were the first club to wear sponsored shirts in English football in 1979.",
    "This team completed a historic Triple Crown of trophies in 1959–60.",
    "They returned to the Premier League under manager Sean Dyche in 2016.",
    "This team has a fierce rivalry with nearby Blackburn Rovers, known as the East Lancashire Derby.",
    "The club has one of the most loyal fanbases, with Turf Moor regularly selling out."
],
"Crystal Palace": [
    "They were founded in 1905 and named after the Crystal Palace Exhibition building",
    "Their home ground, Selhurst Park, has been their stadium since 1924.",
    "The team has never won a major trophy but has reached the FA Cup final twice, in 1990 and 2016.",
    "Their nickname is The Eagles and their mascot is an actual eagle named Kayla.",
    "The team shares a rivalry with Brighton, known as the M23 Derby.",
    "The team academy has produced notable players, including Wilfried Zaha.",
    "They were promoted to the Premier League in 2013 and have remained since.",
    "Ian Wright, a club legend, started his career at this club before joining Arsenal.",
    "They play in red and blue stripes, inspired by FC Barcelona",
    "Roy Hodgson returned to manage this team in 2023 after a successful previous stint."
],
"Everton": [
    "They  were founded in 1878, making them one of England’s oldest football clubs.",
    "Their original ground was Anfield, which later became Liverpool FC’s stadium.",
    "They have won the English league nine times, though their last title was in 1987.",
    "Their home, Goodison Park, has been their ground since 1892./ The team’s nickname, “The Toffees,” relates to the toffee shops in the area.",
    "They have a fierce rivalry with Liverpool, known as the Merseyside Derby.",
    "They are famous for developing young players through its academy.",
    "They are the longest-serving club in the English top division, with over 100 seasons.",
    "Their fans are known for their passionate support, calling themselves “The People’s Club.”",
    "The club is currently building a new stadium at Bramley-Moore Dock, set to open soon"
],
"Fulham": [
    "They are one of London’s oldest clubs, founded in 1879.",
    "Their stadium, Craven Cottage, is located by the River Thames and has a unique, old-fashioned design.",
    "The team's nickname, The Cottagers, is named after their historic ground.",
    "The club’s highest Premier League finish was 7th place in 2008-09.",
    "They have reached the UEFA Europa League final in 2010, losing to Atlético Madrid.",
    "They share a rivalry with Chelsea, known as the West London Derby.",
    "Mohamed Al Fayed, the former owner, installed a statue of Michael Jackson at the stadium.",
    "Fulham has been promoted to the Premier League multiple times in recent years.",
    "The club has a renowned academy, producing players like Ryan Sessegnon.",
    "They are known for their yo-yo status, often bouncing between the Premier League and Championship."
],
"Newcastle United": [
    "They were founded in 1892.",
    "Their home, St. James’ Park, is one of the most iconic stadiums in England.",
    "The club’s nickname, The Magpies comes from their black-and-white striped kits.",
    "The team has won the English league four times, though their last title was in 1927.",
    "Alan Shearer, a local legend, is the club’s all-time leading scorer with 206 goals.",
    "The club was taken over by a Saudi-led consortium in 2021, making it one of the wealthiest clubs.",
    "Their fierce rivalry is Sunderland, known as the Tyne-Wear Derby.",
    "The team reached the FA Cup final three times in the 1990s but didn’t win.",
    "Kevin Keegan, as both player and manager, had a major influence on the club in the ‘80s and ‘90s.",
    "The Geordie fanbase is known for its passionate support and loyalty."
],
"Nottingham Forest": [
    "The club was founded in 1865, making it one of the oldest football clubs in the world.",
    "Their home ground, the City Ground, is located on the banks of the River Trent.",
    "The team is famously known for winning back-to-back European Cups in 1979 and 1980 under Brian Clough.",
    "They have won the FA Cup twice, with their last victory in 1959.",
    "The team red kit inspired Arsenal’s colors in the early 20th century.",
    "The club was promoted to the Premier League in 2022, ending a 23-year absence.",
    "The team's fierce rivalry is with Derby County, known as the East Midlands Derby.",
    "The teams has a Brian Clough’s statue stands in Nottingham, honoring his legendary contribution to the club.",
    "The club’s motto, Forever Forest, reflects the long-standing pride of its fans.",
    "This team was the first club to wear a sponsor’s logo on their shirt in English football."
],
"Sheffield United": [
    "The team was formed in 1889 and is nicknamed The Blades due to Sheffield’s steel industry.",
    "They play at Bramall Lane, one of the oldest stadiums in the world, in use since 1855.",
    "The team was the first club to use the title United.",
    "The Blades won their only league title in 1898 and have four FA Cup victories.",
    "They were the first club to be relegated from the Premier League after its formation in 1992.",
    "Their rivalry with Sheffield Wednesday is known as the Steel City Derby.",
    "The club has a passionate fanbase known for their commitment to the team.",
    "They returned to the Premier League in 2019 after a 12-year absence.",
    "Legendary striker Brian Deane scored the Premier League’s first-ever goal for this club.",
    "The Blades’ academy has produced notable players, including Harry Maguire and Kyle Walker."
],
"Tottenham Hotspur": [
    "The club was founded in 1882.",
    "Their motto is “Audere est Facere,” meaning To Dare Is to Do.",
    "They won the first League and FA Cup Double of the 20th century in 1961.",
    "The club’s iconic cockerel symbol was first added to their kits in 1921.",
    "Their modern home ground opened in 2019.",
    "They have a historic rivalry with Arsenal, known as the North London Derby.",
    "Harry Kane is their all-time leading goal scorer.",
    "They have won the UEFA Cup in 1972, becoming the first British team to win two European trophies.",
    "They were the first non-league club to win the FA Cup, achieving it in 1901.",
    "Their fanbase is known for the chant “Glory, Glory, Tottenham Hotspur.”"
],
"West Ham": [
    "The club was founded in 1895 as Thames Ironworks FC.",
    "Their nickname, The Hammers, is a tribute to their roots in the ironworking industry.",
    "The club’s iconic song, “I’m Forever Blowing Bubbles,” is sung passionately by fans.",
    "The club has won three FA Cups, with their last in 1980.",
    "The club moved from their historic ground, Upton Park, to the London Stadium in 2016.",
    "Their academy is famously known as The Academy of Football, producing players like Frank Lampard and Rio Ferdinand.",
    "Their fierce rivalry with Millwall is known as one of the most intense in English football.",
    "The club’s colors, claret and blue, were inspired by Aston Villa.",
    "They won the Europa Conference League in 2023, their first European trophy in over 50 years.",
    "Bobby Moore, the team’s legend, captained England to their World Cup victory in 1966."
],
"Wolves": [
    "They were founded in 1877 and are one of the founding members of the Football League.",
    "Their home stadium, Molineux, is one of the oldest league stadiums in the country.",
    "They won the English league three times in the 1950s.",
    "They were pioneers in European competition, playing the first floodlit games against teams across Europe.",
    "The club’s nickname, Wolves is inspired by their city’s name, Wolverhampton.",
    "The club have a rivalry with West Bromwich Albion, known as the Black Country Derby.",
    "Wolves' colors are old gold and black, a unique combination in English football.",
    "They were promoted to the Premier League in 2018 under manager Nuno Espirito Santo.",
    "Their home stadium, Molineux, is one of the oldest league stadiums in the country.",
    "They won the English league three times in the 1950s.",
    "They were pioneers in European competition, playing the first floodlit games against teams across Europe.",
    "The club’s nickname, Wolves, is inspired by their city’s name, Wolverhampton."
],
"Liverpool": [
    "The team was founded in 1892.",
    "They have won the English top division 19 times.",
    "The Hillsborough Disaster of 1989 deeply affected the club, leading to justice campaigns.",
    "They have won the European Cup, Champions League six times, more than any other English team.",
    "The club’s fiercest rivalries are with Manchester United and Everton.",
    "Steven Gerrard is considered one of greatest players of the club.",
    "The bagde of the team have a bird.",
    "The team completed a historic treble of cups in the 2000-01 season.",
    "The teamanthem is, “You’ll Never Walk Alone,”."
],
"Manchester City": [
    "The club was founded in 1880, originally as St. Mark's (West Gorton).",
    "The club’s modern success began after being acquired by the Abu Dhabi United Group in 2008.",
    "The team has won the Premier League seven times, with their first in 1937.",
    "The Etihad Stadium, their home ground, is one of the most modern stadiums in England.",
    "Their nickname, The Citizens or City reflects their status as Manchester’s official club.",
    "They completed an English domestic treble in the 2018-19 season.",
    "Pep Guardiola has been the club most successful manager, leading them to multiple titles.",
    "Their rivalry with Manchester United is known as the Manchester Derby.",
    "The club won their first Champions League title in 2023, completing a historic treble.",
    "Sergio Aguero’s last-minute goal in 2012 secured their first Premier League title in dramatic fashion."
],
"Manchester United": [
    "The club was founded in 1878 as Newton Heath.",
    "They have won the English league 20 times, the most in history.",
    "Their home ground is known as the “Theatre of Dreams.”",
    "Sir Alex Ferguson managed this club for 26 years, winning 13 league titles.",
    "They are the only English club to win the Treble (Premier League, FA Cup, and Champions League) in 1999.",
    "They are also known as the red devils.",
    "The team intense rivalry with Liverpool is one of the most famous in world football.",
    "Cristiano Ronaldo began his rise to stardom at this team before returning in 2021.",
    "The “Class of ‘92” produced iconic players like David Beckham and Ryan Giggs.",
    "Wayne Rooney is the club all-time leading scorer with 253 goals"
],
"Real Madrid": [
    "They have won the most UEFA Champions League titles with 14 victories.",
    "Founded in 1902, they are one of the oldest and most successful football clubs in the world.",
    "Their home ground, Santiago Bernabéu Stadium has a capacity of over 81,000 seats.",
    "They are nicknamed 'Los Blancos' due to their iconic white kit.",
    "They has won the most La Liga titles with 35 championships.",
    "They were named the FIFA Club of the 20th Century in 2000.",
    "Zinedine Zidane led them to three consecutive Champions League titles as a coach.",
    "Alfredo Di Stéfano is one of their most legendary players, winning 5 European Cups with the club.",
    "They have a fierce rivalry with FC Barcelona, known as 'El Clásico.'",
    "Cristiano Ronaldo is their all-time leading goal scorer with 450 goals."
],
"Chelsea": [
    "They has won the UEFA Champions League twice.",
    "The club was founded in 1905.",
    "They have won 6 English Premier League titles.",
    "Frank Lampard is the club's all-time top scorer with 211 goals.",
    "They are the only London club to have won the Champions League.",
    "Roman Abramovich's ownership from 2003 to 2022 transformed the club into a global powerhouse.",
    "Chelsea has won 8 FA Cups, with their first in 1970.",
    "They play their home games at Stamford Bridge in London.",
    "Didier Drogba scored the winning penalty in the 2012 Champions League final playing for this team.",
    "They have a strong rivalry with Arsenal, Tottenham, and Fulham."
],
"Barcelona": [
    "They have won the UEFA Champions League 5 times.",
    "Founded in 1899, their motto is 'Més que un club' (More than a club).",
    "Barcelona has won 27 La Liga titles.",
    "They are known for their famous youth academy, La Masia.",
    "Pep Guardiola led them to a historic sextuple in 2009.",
    "Their rivalry with Real Madrid, 'El Clásico,' is one of the most watched games in the world.",
    "They have won the Copa del Rey a record 31 times.",
    "They were the first club to win the treble twice (2008-09 and 2014-15).",
    "Their home ground, The Camp Nou is the largest stadium in Europe, with a capacity of over 99,000.",
    "Lionel Messi is their all-time leading scorer with 672 goals."
],
"Sevilla": [
    "They have won the UEFA Europa League a record 7 times.",
    "The club was founded in 1890, making it one of the oldest in Spain.",
    "They play their home games at the Ramón Sánchez Pizjuán Stadium.",
    "They won their first La Liga title in 1946.",
    "Their nickname is 'Los Nervionenses,' referring to their neighborhood, Nervión.",
    "They won back-to-back Europa League titles in 2006 and 2007 under Juande Ramos.",
    "Éver Banega played a crucial role in multiple Europa League triumphs.",
    "The club's colors are red and white, and their crest includes Saint Isidore.",
    "This team has a fierce rivalry with Real Betis, known as 'El Gran Derbi.'",
    "They have won the Copa del Rey 5 times, most recently in 2010."
],
"Atletico Madrid": [
    "This team has won La Liga 11 times.",
    "They have won the UEFA Europa League 3 times.",
    "The club was founded in 1903 and originally formed by Basque students.",
    "They are nicknamed 'Los Colchoneros' due to their early striped kit resembling mattresses.",
    "They won their first La Liga title in 1939-40.",
    "They play at the Wanda Metropolitano Stadium, opened in 2017.",
    "They had reached the Champions League final 3 times but has yet to win it.",
    "Diego Simeone has been their head coach since 2011 and is their longest-serving manager.",
    "Fernando Torres is one of their most iconic players, nicknamed 'El Niño.'",
    "Their rivalry with Real Madrid is known as 'El Derbi Madrileño.'"
],
"Real Betis": [
    "This team was founded in 1907 in Seville, Spain.",
    "They have won La Liga once, in the 1934-35 season.",
    "They have won the Copa del Rey 3 times, most recently in 2022.",
    "Their home ground is the Benito Villamarín Stadium, with a capacity of over 60,000.",
    "They are nicknamed 'Los Verdiblancos' due to their green and white kit.",
    "They have a passionate rivalry with Sevilla, known as 'El Gran Derbi.'",
    "The club's anthem is one of the most famous in Spanish football.",
    "They returned to La Liga in 2015 after a brief stint in the second division.",
    "They have a strong fan base known as 'Béticos.'",
    "Joaquín, a legendary player, is their all-time appearance leader."
],
"Valencia": [
    "They have won La Liga 6 times.",
    "They have won the Copa del Rey 8 times.",
    "This team won the UEFA Cup Winners' Cup in 1980.",
    "They play at the Mestalla Stadium, with a capacity of around 49,000.",
    "This team reached back-to-back Champions League finals in 2000 and 2001 but lost both.",
    "They were founded in 1919 and are one of Spain's most historic clubs.",
    "David Villa is one of their most iconic players.",
    "They won their last La Liga title in the 2003-04 season under Rafael Benítez.",
    "Their nickname is 'Los Che,' a regional term for Valencians.",
    "The club has a bat on its crest, a symbol of the city."
],
"Villarreal": [
    "This team won their first major European trophy, the UEFA Europa League, in 2021.",
    "The club was founded in 1923 in the small town of Villarreal, Spain.",
    "They are nicknamed 'The Yellow Submarine' due to their yellow kit.",
    "This team's home stadium is the Estadio de la Cerámica.",
    "They reached the Champions League semi-finals in the 2005-06 season.",
    "They returned to La Liga in 2013 after a brief relegation.",
    "The club is known for its excellent scouting and player development.",
    "Juan Román Riquelme was one of their standout players in the mid-2000s.",
    "They defeated Manchester United in the 2021 Europa League final.",
    "Unai Emery led Villarreal to their first major European trophy."
],
"Athletic Bilbao": [
    "This club was founded in 1898 and is one of Spain's oldest clubs.",
    "They only sign players of Basque heritage or from the Basque region.",
    "The club has won La Liga 8 times, most recently in 1984.",
    "This team has won the Copa del Rey 23 times.",
    "They play at the San Mamés Stadium, nicknamed 'The Cathedral.'",
    "Their nickname is 'Los Leones' (The Lions).",
    "This team has never been relegated from La Liga.",
    "They were one of the founding members of La Liga in 1929.",
    "Telmo Zarra is their all-time leading goal scorer.",
    "The club is known for its youth academy, Lezama."
],
"PSG": [
    "This club was founded in 1970.",
    "This team has won the French Ligue 1 title a record 11 times.",
    "They reached their first UEFA Champions League final in 2020 but lost to Bayern Munich.",
    "They are owned by Qatar Sports Investments since 2011.",
    "Zlatan Ibrahimović is one of their most iconic players, with 156 goals.",
    "This team nicknamed is 'Les Parisiens' and 'Les Rouge-et-Bleu.'",
    "Lionel Messi joined this team in 2021 after leaving Barcelona.",
    "The club has a heated rivalry with Olympique de Marseille, known as 'Le Classique.'",
    "They play their home games at the Parc des Princes in Paris.",
    "Neymar's transfer from Barcelona to this team in 2017 was a world-record fee of €222 million."
],
"Borussia Dortmund": [
    "This team was founded in 1909.",
    "This team has won the Bundesliga 8 times.",
    "They won the UEFA Champions League in 1997, defeating Juventus in the final.",
    "Their nickname is 'Die Schwarzgelben'.",
    "The club's youth academy has produced stars like Marco Reus and Mario Götze.",
    "They have a fierce rivalry with Schalke 04, known as the 'Revierderby.'",
    "This team's famous 'Yellow Wall' is one of the largest and most passionate fan sections in the world.",
    "They won the DFB-Pokal 5 times.",
    "Erling Haaland was one of their top scorers before moving to Manchester City.",
    "They play at Signal Iduna Park, the largest stadium in Germany, with over 81,000 capacity."
],
"Bayern Munich": [
    "This team has won the Bundesliga a record 33 times.",
    "They have won the UEFA Champions League 6 times.",
    "The club has also won the FIFA Club World Cup twice.",
    "They play at the Allianz Arena, known for its unique illuminated exterior.",
    "Gerd Müller is their all-time leading scorer with 563 goals.",
    "They won the treble (Bundesliga, DFB-Pokal, and Champions League) in 2013 and 2020.",
    "They are nicknamed 'Die Roten' (The Reds).",
    "The club is one of the founding members of the European Club Association.",
    "They have a strong rivalry with Borussia Dortmund, known as 'Der Klassiker.'",
    "The club was founded in 1900 in Munich, Germany."
],
"Olympique de Marseille": [
    "This team was founded in 1899 and is one of France's oldest clubs.",
    "They are the only French club to win the UEFA Champions League, in 1993.",
    "Their home ground is the Stade Vélodrome, with a capacity of over 67,000.",
    "This team has won the Ligue 1 title 9 times.",
    "They have a heated rivalry with PSG, known as 'Le Classique.'",
    "The club's nickname is 'Les Phocéens,' referencing the city's ancient Greek roots.",
    "Jean-Pierre Papin is one of their most iconic players.",
    "They have won the Coupe de France 10 times.",
    "Their supporters are among the most passionate in European football.",
    "Didier Deschamps captained Marseille to their Champions League triumph."
],
"Inter Milan": [
    "This team was founded in 1908.",
    "They have won the Serie A title 19 times.",
    "This team has won the UEFA Champions League 3 times, most recently in 2010 under José Mourinho.",
    "Their nickname is 'Nerazzurri' (Black and Blues).",
    "This team has a fierce rivalry with AC Milan, known as the 'Derby della Madonnina.'",
    "Javier Zanetti is their most capped player and a club legend.",
    "They completed a historic treble in 2010, winning the Serie A, Coppa Italia, and Champions League.",
    "This team has won the Coppa Italia 9 times.",
    "They lost the Champions League final in 2023 against Man City.",
    "They play at the San Siro, which they share with AC Milan."
],
"AC Milan": [
    "This team was founded in 1899 and is one of the most successful clubs in the world.",
    "They have won the UEFA Champions League 7 times, second only to Real Madrid.",
    "They have won the Serie A title 19 times.",
    "They share the San Siro Stadium with Inter Milan.",
    "The club's nickname is 'Rossoneri' (Red and Blacks).",
    "Paolo Maldini, a club legend, made over 900 appearances for this team.",
    "They completed a historic unbeaten season in Serie A in 1991-92.",
    "They won their most recent Champions League title in 2007.",
    "The club has also won the FIFA Club World Cup once.",
    "They have won the Coppa Italia 5 times."
],
"Juventus": [
    "This team has won the Serie A title a record 36 times.",
    "The club was founded in 1897 and is based in Turin, Italy.",
    "This team has won the UEFA Champions League twice, in 1985 and 1996.",
    "They play at the Allianz Stadium, opened in 2011.",
    "Their nickname is 'The Old Lady' ('La Vecchia Signora').",
    "Gianluigi Buffon is one of their most iconic players and a record appearance holder.",
    "They completed an unbeaten Serie A season in 2011-12.",
    "They have won the Coppa Italia a record 14 times.",
    "Cristiano Ronaldo joined this team in 2018 and scored over 100 goals for the club.",
    "It is the most supported club in Italy."
],
"AS Roma": [
    "This team was founded in 1927 in Rome, Italy.",
    "They have won the Serie A title 3 times, most recently in 2000-01.",
    "The teams's home ground is the Stadio Olimpico, which they share with Lazio.",
    "Their nickname is 'I Giallorossi' (The Yellow and Reds).",
    "Francesco Totti is the club's all-time top scorer and most iconic player.",
    "They won the inaugural UEFA Europa Conference League in 2022.",
    "They have won the Coppa Italia 9 times.",
    "The club has a fierce rivalry with Lazio, known as the 'Derby della Capitale.'",
    "Daniele De Rossi is another legendary figure in the club's history.",
    "They reached the European Cup final in 1984 but lost to Liverpool."
],
"Napoli": [
    "This team was founded in 1926 in Naples, Italy.",
    "They have won the Serie A title 3 times, most recently in 2022-23.",
    "The team's home ground is the Stadio Diego Armando Maradona.",
    "Diego Maradona led the club to its first two Serie A titles in 1987 and 1990.",
    "The club has won the Coppa Italia 6 times.",
    "Their nickname is 'Gli Azzurri' (The Blues).",
    "They won the UEFA Cup in 1989.",
    "They have a passionate rivalry with Juventus, known as the 'Derby del Sole.'",
    "Lorenzo Insigne was a key player for the club for over a decade.",
    "Victor Osimhen played a pivotal role in their 2023 Scudetto win."
],
"Benfica": [
    "This was founded in 1904 in Lisbon, Portugal.",
    "They have won the Primeira Liga a record 38 times.",
    "They won back-to-back European Cups in 1961 and 1962.",
    "Their home ground is the Estádio da Luz, nicknamed 'The Stadium of Light.'",
    "Eusébio is their most iconic player, winning the Ballon d'Or in 1965.",
    "The club is nicknamed 'As Águias' (The Eagles).",
    "They holds the record for the longest unbeaten run in the Portuguese league.",
    "They have won the Taça de Portugal 26 times.",
    "The 'curse of Béla Guttmann' is a famous legend associated with the club.",
    "This team has one of the largest fan bases in Portugal."
],
"Sporting CP": [
    "The team was founded in 1906 in Lisbon, Portugal.",
    "They have won the Primeira Liga 19 times.",
    "This team's youth academy produced stars like Cristiano Ronaldo and Luís Figo.",
    "Their home ground is the Estádio José Alvalade.",
    "They won their most recent league title in the 2020-21 season.",
    "They won the Taça de Portugal 17 times.",
    "The club is nicknamed 'Os Leões' (The Lions).",
    "They won the UEFA Cup Winners' Cup in 1964.",
    "They have a fierce rivalry with Benfica, known as 'O Dérbi de Lisboa.'",
    "Rui Patrício is one of their most notable goalkeepers."
],
"Porto": [
    "This team was founded in 1893 in Porto, Portugal.",
    "They have won the Primeira Liga 30 times.",
    "They won the UEFA Champions League in 1987 and 2004.",
    "Their home stadium is the Estádio do Dragão (Stadium of the Dragon).",
    "They won the Europa League in 2003 under José Mourinho.",
    "They are nicknamed 'Os Dragões' (The Dragons).",
    "Hulk and Deco are among their most famous players.",
    "This team has won the Taça de Portugal 18 times.",
    "They are fierce rivals with Benfica and Sporting CP.",
    "They were the first Portuguese club to win the Champions League."
],
"Kaizer Chiefs": [
    "This team was founded in 1970 in Johannesburg, South Africa.",
    "They have won the South African Premier Division 13 times.",
    "Their nickname is 'Amakhosi,' meaning 'Chiefs' or 'Lords' in Zulu.",
    "This team home ground is the FNB Stadium in Johannesburg.",
    "The club is named after its founder, Kaizer Motaung.",
    "They have a fierce rivalry with Orlando Pirates, known as the 'Soweto Derby.'",
    "They have won the MTN8 tournament 15 times.",
    "They are one of the most supported clubs in Africa.",
    "Their colors are gold and black, symbolizing wealth and power.",
    "They were runners-up in the 2021 CAF Champions League."
],
"Orlando Pirates": [
    "This team was founded in 1937 in Soweto, South Africa.",
    "They are one of South Africa's oldest and most successful clubs.",
    "The club's nickname is 'The Buccaneers.'",
    "They have won the South African Premier Division 4 times.",
    "They won the CAF Champions League in 1995.",
    "The team plays their home games at Orlando Stadium in Soweto.",
    "They have won the MTN8 tournament 11 times.",
    "They have a fierce rivalry with Kaizer Chiefs, known as the 'Soweto Derby.'",
    "Their traditional colors are black and white.",
    "Jomo Sono is one of the club's most iconic players."
],

"Al Ahly": [
    "This team was founded in 1907 in Cairo, Egypt.",
    "They have won the Egyptian Premier League a record 43 times.",
    "They have won the CAF Champions League a record 11 times.",
    "The club's nickname is 'The Club of the Century' in Africa.",
    "Their home ground is the Cairo International Stadium.",
    "They have a fierce rivalry with Zamalek SC, known as the 'Cairo Derby.'",
    "This team has won the CAF Super Cup 8 times.",
    "The club is nicknamed 'The Red Devils.'",
    "They are the most successful club in African football history.",
    "Mohamed Aboutrika is one of their most legendary players."
],
"Boca Juniors": [
    "This team was founded in 1905 in Buenos Aires, Argentina.",
    "They play their home games at La Bombonera, one of the most iconic stadiums in the world.",
    "They have won the Copa Libertadores 6 times.",
    "Their nickname is 'Los Xeneizes,' reflecting their Genoese immigrant roots.",
    "They have a fierce rivalry with River Plate, known as the 'Superclásico.'",
    "Diego Maradona played for this and is one of their most legendary players.",
    "They have won the Argentine Primera División 35 times.",
    "They have also won the Intercontinental Cup 3 times.",
    "Carlos Tevez had multiple successful stints at the club.",
    "Their colors, blue and gold, were inspired by the Swedish flag."
],
"River Plate": [
    "This team was founded in 1901 in Buenos Aires, Argentina.",
    "They have won the Argentine Primera División a record 38 times.",
    "They have won the Copa Libertadores 4 times.",
    "Their home ground is the Estadio Monumental, the largest stadium in Argentina.",
    "The team's nickname is 'Los Millonarios' (The Millionaires).",
    "They have a fierce rivalry with Boca Juniors, known as the 'Superclásico.'",
    "Marcelo Gallardo is a legendary player and manager for this team.",
    "They have won the Copa Sudamericana once, in 2014.",
    "Enzo Francescoli is one of their most iconic players.",
    "The club has won the Intercontinental Cup once, in 1986."
],
"Flamengo": [
    "This team was founded in 1895 in Rio de Janeiro, Brazil.",
    "They are one of the most popular and successful clubs in Brazil.",
    "They have won the Copa Libertadores twice, in 1981 and 2019.",
    "Their home ground is the Maracanã Stadium.",
    "This team has won the Campeonato Brasileiro Série A 8 times.",
    "Their nickname is 'Mengão.'",
    "Zico, known as the 'White Pelé,' is their most legendary player.",
    "They won the Intercontinental Cup in 1981.",
    "They are one of the most widely supported clubs in the world.",
    "They have a fierce rivalry with Fluminense, known as 'Fla-Flu.'"
],
"Palmeiras": [
    "This team was founded in 1914 in São Paulo, Brazil.",
    "They have won the Copa Libertadores 3 times, most recently in 2021.",
    "They have won the Campeonato Brasileiro Série A a record 11 times.",
    "Their home stadium is Allianz Parque in São Paulo.",
    "The club's nickname is 'Verdão' (Big Green).",
    "This team won the inaugural Copa Rio Internacional in 1951, seen as a precursor to the Club World Cup.",
    "They have won the Copa do Brasil 4 times.",
    "The club has a fierce rivalry with Corinthians, known as the 'Paulista Derby.'",
    "Marcos is one of their most iconic players and was instrumental in their Libertadores win in 1999.",
    "This team is one of the wealthiest clubs in Brazil."
],
"Fluminense": [
    "This team was founded in 1902 in Rio de Janeiro, Brazil.",
    "They have won the Campeonato Brasileiro Série A 4 times.",
    "The team's home ground is the Maracanã Stadium.",
    "Their nickname is 'Tricolor' (Three Colors) due to their red, green, and white kit.",
    "They have a fierce rivalry with Flamengo, known as 'Fla-Flu.'",
    "They won the Copa do Brasil in 2007.",
    "Fred is one of their most iconic players and all-time top scorer.",
    "This team has also won the Campeonato Carioca 32 times.",
    "They are one of Brazil's oldest football clubs.",
    "Their fans are known as 'Tricolores.'"
]
    
}